{
  "url": "https://www.drugs.com/drug-interactions/acebutolol-with-taurine-10-0-4071-0.html",
  "description": [
    "This report displays the potential drug interactions for the following 2 drugs:",
    "Taurine may add to the blood pressure lowering effects of acebutolol.  You may need a dose adjustment or more frequent monitoring of your blood pressure to safely use both medications.  Contact your doctor if you experience dizziness, weakness, fatigue, lightheadedness, headache, flushing, fainting, or a rapid pulse or heart rate.  Avoid driving or operating hazardous machinery until you know how these medications affect you, and use caution when getting up from a sitting or lying position.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Acebutolol and ethanol (alcohol) may have additive effects in lowering your blood pressure.  You may experience headache, dizziness, lightheadedness, fainting, and/or changes in pulse or heart rate.  These side effects are most likely to be seen at the beginning of treatment, following a dose increase, or when treatment is restarted after an interruption.  Let your doctor know if you develop these symptoms and they do not go away after a few days or they become troublesome.  Avoid driving or operating hazardous machinery until you know how the medications affect you, and use caution when getting up from a sitting or lying position.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Using acebutolol together with multivitamin with minerals may decrease the effects of acebutolol.  Separate the administration times of acebutolol and multivitamin with minerals by at least 2 hours.  If your doctor does prescribe these medications together, you may need a dose adjustment or special test to safely use both medications.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) in patients with a history of allergic reactions or anaphylaxis may be associated with heightened reactivity to culprit allergens.  The frequency and/or severity of attacks may be increased during beta-blocker therapy.  In addition, these patients may be refractory to the usual doses of epinephrine used to treat acute hypersensitivity reactions and may require a beta-agonist such as isoproterenol.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) in general should not be used in patients with overt congestive heart failure (CHF).  Sympathetic stimulation may be important in maintaining the hemodynamic function in these patients, thus beta-blockade can worsen the heart failure.  However, therapy with beta-blockers may be beneficial and can be administered cautiously in some CHF patients provided they are well compensated and receiving digitalis, diuretics, an ACE inhibitor, and/or nitrates.  Carvedilol, specifically, is indicated for use with these agents in the treatment of mild to severe heart failure of ischemic or cardiomyopathic origin.  There is also increasing evidence that the addition of a beta-blocker to standard therapy can improve morbidity and mortality in patients with advanced heart failure, although it is uncertain whether effectiveness varies significantly with the different agents.  Data from one meta-analysis study suggest a greater reduction of mortality risk for nonselective beta-blockers than for beta-1 selective agents.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may mask symptoms of hypoglycemia such as tremors, tachycardia and blood pressure changes.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may inhibit catecholamine-mediated glycogenolysis, thereby potentiating insulin-induced hypoglycemia and delaying the recovery of normal blood glucose levels.  Since cardioselectivity is not absolute, larger doses of beta-1 selective agents may demonstrate these effects as well.  Therapy with beta-blockers should be administered cautiously in patients with diabetes or predisposed to spontaneous hypoglycemia.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Acebutolol is moderately removed by hemodialysis and should be administered after dialysis when the patient is hemodynamically stable to avoid marked falls in blood pressure.  The hemodynamic status should be closely monitored before and after the dose.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Heightened sensitivity to catecholamines may occur after prolonged use of beta-adrenergic receptor blocking agents (aka beta-blockers).  Exacerbation of angina, myocardial infarction and ventricular arrhythmias have been reported in patients with coronary artery disease following abrupt withdrawal of therapy.  Cessation of beta-blocker therapy, whenever necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks in patients with coronary insufficiency.  Patients should be advised not to discontinue treatment without first consulting with the physician.  In patients who experience an exacerbation of angina following discontinuation of beta-blocker therapy, the medication should generally be reinstituted, at least temporarily, along with other clinically appropriate measures.",
    "Due to their negative inotropic and chronotropic effects on the heart, beta-adrenergic receptor blocking agents (aka beta-blockers) reduce cardiac output and may precipitate or aggravate symptoms of arterial insufficiency in patients with peripheral vascular disease.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may attenuate catecholamine-mediated vasodilation during exercise by blocking beta-2 receptors in peripheral vessels.  Therapy with beta-blockers should be administered cautiously in patients with peripheral vascular disease.  Close monitoring for progression of arterial obstruction is advised.",
    "The active metabolite of acebutolol, diacetolol, is eliminated primarily by the kidney.  Patients with renal impairment may be at greater risk for adverse effects due to metabolite accumulation.  Dosage adjustments are recommended for patients with moderate to severe renal dysfunction (CrCl < 50 mL/min).",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Beta-adrenergic blocking agents (beta-blockers), should be used with caution in patients with cerebrovascular insufficiency because of their potential effects relative to blood pressure and pulse.  If signs or symptoms suggesting reduced cerebral blood flow are observed, consideration should be given to discontinuing these agents.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Systemic beta-adrenergic receptor blocking agents (aka beta-blockers) may lower intraocular pressure.  Therefore, patients with glaucoma or intraocular hypertension may require adjustments in their ophthalmic regimen following a dosing change or discontinuation of beta-blocker therapy.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may alter serum lipid profiles.  Increases in serum VLDL and LDL cholesterol and triglycerides, as well as decreases in HDL cholesterol, have been reported with some beta-blockers.  Patients with preexisting hyperlipidemia may require closer monitoring during beta-blocker therapy, and adjustments made accordingly in their lipid-lowering regimen.",
    "When beta-adrenergic receptor blocking agents (aka beta-blockers) are used to alleviate symptoms of hyperthyroidism such as tachycardia, anxiety, tremor and heat intolerance, abrupt withdrawal can exacerbate thyrotoxicosis or precipitate a thyroid storm.  To minimize this risk, cessation of beta-blocker therapy, when necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks.  Patients should be advised not to discontinue treatment without first consulting with the physician.  Close monitoring is recommended during and after therapy withdrawal.",
    "Acebutolol should be used cautiously in patients with impaired hepatic function.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may potentiate muscle weakness consistent with certain myasthenic symptoms such as diplopia, ptosis, and generalized weakness.  Several beta-blockers have been associated rarely with aggravation of muscle weakness in patients with preexisting myasthenia gravis or myasthenic symptoms.  Use cautiously in patients with myasthenia gravis.",
    "Administration of beta-blockers alone in the setting of pheochromocytoma has been associated with a paradoxical increase in blood pressure due to the attenuation of beta receptor-mediated vasodilatation in skeletal muscle.  In patients with pheochromocytoma, an alpha-blocking agent should be initiated prior to the use of any beta-blocking agent.  Caution should be taken in the administration of these agents to patients suspected of having pheochromocytoma.",
    "The use of beta-blockers in psoriatic patients should be carefully weighed since the use of these agents may cause an aggravation in psoriasis.",
    "Beta-adrenergic blockade in patients with Wolff-Parkinson-White syndrome and tachycardia has been associated with severe bradycardia requiring treatment with a pacemaker.  In one case, this result was reported after an initial dose of 5 mg propranolol.  The use of beta-adrenergic receptor blocking agents (aka beta-blockers) should be administered cautiously in these patients.",
    "Therapeutic duplication warnings are only returned when drugs within the same group exceed the recommended therapeutic duplication maximum.",
    "Always consult your healthcare provider to ensure the information displayed on this page applies to your personal circumstances.",
    "Taurine may add to the blood pressure lowering effects of acebutolol.  You may need a dose adjustment or more frequent monitoring of your blood pressure to safely use both medications.  Contact your doctor if you experience dizziness, weakness, fatigue, lightheadedness, headache, flushing, fainting, or a rapid pulse or heart rate.  Avoid driving or operating hazardous machinery until you know how these medications affect you, and use caution when getting up from a sitting or lying position.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Acebutolol and ethanol (alcohol) may have additive effects in lowering your blood pressure.  You may experience headache, dizziness, lightheadedness, fainting, and/or changes in pulse or heart rate.  These side effects are most likely to be seen at the beginning of treatment, following a dose increase, or when treatment is restarted after an interruption.  Let your doctor know if you develop these symptoms and they do not go away after a few days or they become troublesome.  Avoid driving or operating hazardous machinery until you know how the medications affect you, and use caution when getting up from a sitting or lying position.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Using acebutolol together with multivitamin with minerals may decrease the effects of acebutolol.  Separate the administration times of acebutolol and multivitamin with minerals by at least 2 hours.  If your doctor does prescribe these medications together, you may need a dose adjustment or special test to safely use both medications.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) in patients with a history of allergic reactions or anaphylaxis may be associated with heightened reactivity to culprit allergens.  The frequency and/or severity of attacks may be increased during beta-blocker therapy.  In addition, these patients may be refractory to the usual doses of epinephrine used to treat acute hypersensitivity reactions and may require a beta-agonist such as isoproterenol.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) in general should not be used in patients with overt congestive heart failure (CHF).  Sympathetic stimulation may be important in maintaining the hemodynamic function in these patients, thus beta-blockade can worsen the heart failure.  However, therapy with beta-blockers may be beneficial and can be administered cautiously in some CHF patients provided they are well compensated and receiving digitalis, diuretics, an ACE inhibitor, and/or nitrates.  Carvedilol, specifically, is indicated for use with these agents in the treatment of mild to severe heart failure of ischemic or cardiomyopathic origin.  There is also increasing evidence that the addition of a beta-blocker to standard therapy can improve morbidity and mortality in patients with advanced heart failure, although it is uncertain whether effectiveness varies significantly with the different agents.  Data from one meta-analysis study suggest a greater reduction of mortality risk for nonselective beta-blockers than for beta-1 selective agents.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may mask symptoms of hypoglycemia such as tremors, tachycardia and blood pressure changes.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may inhibit catecholamine-mediated glycogenolysis, thereby potentiating insulin-induced hypoglycemia and delaying the recovery of normal blood glucose levels.  Since cardioselectivity is not absolute, larger doses of beta-1 selective agents may demonstrate these effects as well.  Therapy with beta-blockers should be administered cautiously in patients with diabetes or predisposed to spontaneous hypoglycemia.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Acebutolol is moderately removed by hemodialysis and should be administered after dialysis when the patient is hemodynamically stable to avoid marked falls in blood pressure.  The hemodynamic status should be closely monitored before and after the dose.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Heightened sensitivity to catecholamines may occur after prolonged use of beta-adrenergic receptor blocking agents (aka beta-blockers).  Exacerbation of angina, myocardial infarction and ventricular arrhythmias have been reported in patients with coronary artery disease following abrupt withdrawal of therapy.  Cessation of beta-blocker therapy, whenever necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks in patients with coronary insufficiency.  Patients should be advised not to discontinue treatment without first consulting with the physician.  In patients who experience an exacerbation of angina following discontinuation of beta-blocker therapy, the medication should generally be reinstituted, at least temporarily, along with other clinically appropriate measures.",
    "Due to their negative inotropic and chronotropic effects on the heart, beta-adrenergic receptor blocking agents (aka beta-blockers) reduce cardiac output and may precipitate or aggravate symptoms of arterial insufficiency in patients with peripheral vascular disease.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may attenuate catecholamine-mediated vasodilation during exercise by blocking beta-2 receptors in peripheral vessels.  Therapy with beta-blockers should be administered cautiously in patients with peripheral vascular disease.  Close monitoring for progression of arterial obstruction is advised.",
    "The active metabolite of acebutolol, diacetolol, is eliminated primarily by the kidney.  Patients with renal impairment may be at greater risk for adverse effects due to metabolite accumulation.  Dosage adjustments are recommended for patients with moderate to severe renal dysfunction (CrCl < 50 mL/min).",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Beta-adrenergic blocking agents (beta-blockers), should be used with caution in patients with cerebrovascular insufficiency because of their potential effects relative to blood pressure and pulse.  If signs or symptoms suggesting reduced cerebral blood flow are observed, consideration should be given to discontinuing these agents.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Systemic beta-adrenergic receptor blocking agents (aka beta-blockers) may lower intraocular pressure.  Therefore, patients with glaucoma or intraocular hypertension may require adjustments in their ophthalmic regimen following a dosing change or discontinuation of beta-blocker therapy.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may alter serum lipid profiles.  Increases in serum VLDL and LDL cholesterol and triglycerides, as well as decreases in HDL cholesterol, have been reported with some beta-blockers.  Patients with preexisting hyperlipidemia may require closer monitoring during beta-blocker therapy, and adjustments made accordingly in their lipid-lowering regimen.",
    "When beta-adrenergic receptor blocking agents (aka beta-blockers) are used to alleviate symptoms of hyperthyroidism such as tachycardia, anxiety, tremor and heat intolerance, abrupt withdrawal can exacerbate thyrotoxicosis or precipitate a thyroid storm.  To minimize this risk, cessation of beta-blocker therapy, when necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks.  Patients should be advised not to discontinue treatment without first consulting with the physician.  Close monitoring is recommended during and after therapy withdrawal.",
    "Acebutolol should be used cautiously in patients with impaired hepatic function.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may potentiate muscle weakness consistent with certain myasthenic symptoms such as diplopia, ptosis, and generalized weakness.  Several beta-blockers have been associated rarely with aggravation of muscle weakness in patients with preexisting myasthenia gravis or myasthenic symptoms.  Use cautiously in patients with myasthenia gravis.",
    "Administration of beta-blockers alone in the setting of pheochromocytoma has been associated with a paradoxical increase in blood pressure due to the attenuation of beta receptor-mediated vasodilatation in skeletal muscle.  In patients with pheochromocytoma, an alpha-blocking agent should be initiated prior to the use of any beta-blocking agent.  Caution should be taken in the administration of these agents to patients suspected of having pheochromocytoma.",
    "The use of beta-blockers in psoriatic patients should be carefully weighed since the use of these agents may cause an aggravation in psoriasis.",
    "Beta-adrenergic blockade in patients with Wolff-Parkinson-White syndrome and tachycardia has been associated with severe bradycardia requiring treatment with a pacemaker.  In one case, this result was reported after an initial dose of 5 mg propranolol.  The use of beta-adrenergic receptor blocking agents (aka beta-blockers) should be administered cautiously in these patients.",
    "Therapeutic duplication warnings are only returned when drugs within the same group exceed the recommended therapeutic duplication maximum.",
    "Taurine may add to the blood pressure lowering effects of acebutolol.  You may need a dose adjustment or more frequent monitoring of your blood pressure to safely use both medications.  Contact your doctor if you experience dizziness, weakness, fatigue, lightheadedness, headache, flushing, fainting, or a rapid pulse or heart rate.  Avoid driving or operating hazardous machinery until you know how these medications affect you, and use caution when getting up from a sitting or lying position.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Acebutolol and ethanol (alcohol) may have additive effects in lowering your blood pressure.  You may experience headache, dizziness, lightheadedness, fainting, and/or changes in pulse or heart rate.  These side effects are most likely to be seen at the beginning of treatment, following a dose increase, or when treatment is restarted after an interruption.  Let your doctor know if you develop these symptoms and they do not go away after a few days or they become troublesome.  Avoid driving or operating hazardous machinery until you know how the medications affect you, and use caution when getting up from a sitting or lying position.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Using acebutolol together with multivitamin with minerals may decrease the effects of acebutolol.  Separate the administration times of acebutolol and multivitamin with minerals by at least 2 hours.  If your doctor does prescribe these medications together, you may need a dose adjustment or special test to safely use both medications.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Acebutolol and ethanol (alcohol) may have additive effects in lowering your blood pressure.  You may experience headache, dizziness, lightheadedness, fainting, and/or changes in pulse or heart rate.  These side effects are most likely to be seen at the beginning of treatment, following a dose increase, or when treatment is restarted after an interruption.  Let your doctor know if you develop these symptoms and they do not go away after a few days or they become troublesome.  Avoid driving or operating hazardous machinery until you know how the medications affect you, and use caution when getting up from a sitting or lying position.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "Using acebutolol together with multivitamin with minerals may decrease the effects of acebutolol.  Separate the administration times of acebutolol and multivitamin with minerals by at least 2 hours.  If your doctor does prescribe these medications together, you may need a dose adjustment or special test to safely use both medications.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) in patients with a history of allergic reactions or anaphylaxis may be associated with heightened reactivity to culprit allergens.  The frequency and/or severity of attacks may be increased during beta-blocker therapy.  In addition, these patients may be refractory to the usual doses of epinephrine used to treat acute hypersensitivity reactions and may require a beta-agonist such as isoproterenol.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) in general should not be used in patients with overt congestive heart failure (CHF).  Sympathetic stimulation may be important in maintaining the hemodynamic function in these patients, thus beta-blockade can worsen the heart failure.  However, therapy with beta-blockers may be beneficial and can be administered cautiously in some CHF patients provided they are well compensated and receiving digitalis, diuretics, an ACE inhibitor, and/or nitrates.  Carvedilol, specifically, is indicated for use with these agents in the treatment of mild to severe heart failure of ischemic or cardiomyopathic origin.  There is also increasing evidence that the addition of a beta-blocker to standard therapy can improve morbidity and mortality in patients with advanced heart failure, although it is uncertain whether effectiveness varies significantly with the different agents.  Data from one meta-analysis study suggest a greater reduction of mortality risk for nonselective beta-blockers than for beta-1 selective agents.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may mask symptoms of hypoglycemia such as tremors, tachycardia and blood pressure changes.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may inhibit catecholamine-mediated glycogenolysis, thereby potentiating insulin-induced hypoglycemia and delaying the recovery of normal blood glucose levels.  Since cardioselectivity is not absolute, larger doses of beta-1 selective agents may demonstrate these effects as well.  Therapy with beta-blockers should be administered cautiously in patients with diabetes or predisposed to spontaneous hypoglycemia.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Acebutolol is moderately removed by hemodialysis and should be administered after dialysis when the patient is hemodynamically stable to avoid marked falls in blood pressure.  The hemodynamic status should be closely monitored before and after the dose.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Heightened sensitivity to catecholamines may occur after prolonged use of beta-adrenergic receptor blocking agents (aka beta-blockers).  Exacerbation of angina, myocardial infarction and ventricular arrhythmias have been reported in patients with coronary artery disease following abrupt withdrawal of therapy.  Cessation of beta-blocker therapy, whenever necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks in patients with coronary insufficiency.  Patients should be advised not to discontinue treatment without first consulting with the physician.  In patients who experience an exacerbation of angina following discontinuation of beta-blocker therapy, the medication should generally be reinstituted, at least temporarily, along with other clinically appropriate measures.",
    "Due to their negative inotropic and chronotropic effects on the heart, beta-adrenergic receptor blocking agents (aka beta-blockers) reduce cardiac output and may precipitate or aggravate symptoms of arterial insufficiency in patients with peripheral vascular disease.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may attenuate catecholamine-mediated vasodilation during exercise by blocking beta-2 receptors in peripheral vessels.  Therapy with beta-blockers should be administered cautiously in patients with peripheral vascular disease.  Close monitoring for progression of arterial obstruction is advised.",
    "The active metabolite of acebutolol, diacetolol, is eliminated primarily by the kidney.  Patients with renal impairment may be at greater risk for adverse effects due to metabolite accumulation.  Dosage adjustments are recommended for patients with moderate to severe renal dysfunction (CrCl < 50 mL/min).",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Beta-adrenergic blocking agents (beta-blockers), should be used with caution in patients with cerebrovascular insufficiency because of their potential effects relative to blood pressure and pulse.  If signs or symptoms suggesting reduced cerebral blood flow are observed, consideration should be given to discontinuing these agents.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Systemic beta-adrenergic receptor blocking agents (aka beta-blockers) may lower intraocular pressure.  Therefore, patients with glaucoma or intraocular hypertension may require adjustments in their ophthalmic regimen following a dosing change or discontinuation of beta-blocker therapy.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may alter serum lipid profiles.  Increases in serum VLDL and LDL cholesterol and triglycerides, as well as decreases in HDL cholesterol, have been reported with some beta-blockers.  Patients with preexisting hyperlipidemia may require closer monitoring during beta-blocker therapy, and adjustments made accordingly in their lipid-lowering regimen.",
    "When beta-adrenergic receptor blocking agents (aka beta-blockers) are used to alleviate symptoms of hyperthyroidism such as tachycardia, anxiety, tremor and heat intolerance, abrupt withdrawal can exacerbate thyrotoxicosis or precipitate a thyroid storm.  To minimize this risk, cessation of beta-blocker therapy, when necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks.  Patients should be advised not to discontinue treatment without first consulting with the physician.  Close monitoring is recommended during and after therapy withdrawal.",
    "Acebutolol should be used cautiously in patients with impaired hepatic function.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may potentiate muscle weakness consistent with certain myasthenic symptoms such as diplopia, ptosis, and generalized weakness.  Several beta-blockers have been associated rarely with aggravation of muscle weakness in patients with preexisting myasthenia gravis or myasthenic symptoms.  Use cautiously in patients with myasthenia gravis.",
    "Administration of beta-blockers alone in the setting of pheochromocytoma has been associated with a paradoxical increase in blood pressure due to the attenuation of beta receptor-mediated vasodilatation in skeletal muscle.  In patients with pheochromocytoma, an alpha-blocking agent should be initiated prior to the use of any beta-blocking agent.  Caution should be taken in the administration of these agents to patients suspected of having pheochromocytoma.",
    "The use of beta-blockers in psoriatic patients should be carefully weighed since the use of these agents may cause an aggravation in psoriasis.",
    "Beta-adrenergic blockade in patients with Wolff-Parkinson-White syndrome and tachycardia has been associated with severe bradycardia requiring treatment with a pacemaker.  In one case, this result was reported after an initial dose of 5 mg propranolol.  The use of beta-adrenergic receptor blocking agents (aka beta-blockers) should be administered cautiously in these patients.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) in patients with a history of allergic reactions or anaphylaxis may be associated with heightened reactivity to culprit allergens.  The frequency and/or severity of attacks may be increased during beta-blocker therapy.  In addition, these patients may be refractory to the usual doses of epinephrine used to treat acute hypersensitivity reactions and may require a beta-agonist such as isoproterenol.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) in general should not be used in patients with overt congestive heart failure (CHF).  Sympathetic stimulation may be important in maintaining the hemodynamic function in these patients, thus beta-blockade can worsen the heart failure.  However, therapy with beta-blockers may be beneficial and can be administered cautiously in some CHF patients provided they are well compensated and receiving digitalis, diuretics, an ACE inhibitor, and/or nitrates.  Carvedilol, specifically, is indicated for use with these agents in the treatment of mild to severe heart failure of ischemic or cardiomyopathic origin.  There is also increasing evidence that the addition of a beta-blocker to standard therapy can improve morbidity and mortality in patients with advanced heart failure, although it is uncertain whether effectiveness varies significantly with the different agents.  Data from one meta-analysis study suggest a greater reduction of mortality risk for nonselective beta-blockers than for beta-1 selective agents.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may mask symptoms of hypoglycemia such as tremors, tachycardia and blood pressure changes.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may inhibit catecholamine-mediated glycogenolysis, thereby potentiating insulin-induced hypoglycemia and delaying the recovery of normal blood glucose levels.  Since cardioselectivity is not absolute, larger doses of beta-1 selective agents may demonstrate these effects as well.  Therapy with beta-blockers should be administered cautiously in patients with diabetes or predisposed to spontaneous hypoglycemia.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Acebutolol is moderately removed by hemodialysis and should be administered after dialysis when the patient is hemodynamically stable to avoid marked falls in blood pressure.  The hemodynamic status should be closely monitored before and after the dose.",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with hypotension or cardiogenic shock.  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to further depress cardiac output and blood pressure, which can be detrimental in these patients.",
    "Heightened sensitivity to catecholamines may occur after prolonged use of beta-adrenergic receptor blocking agents (aka beta-blockers).  Exacerbation of angina, myocardial infarction and ventricular arrhythmias have been reported in patients with coronary artery disease following abrupt withdrawal of therapy.  Cessation of beta-blocker therapy, whenever necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks in patients with coronary insufficiency.  Patients should be advised not to discontinue treatment without first consulting with the physician.  In patients who experience an exacerbation of angina following discontinuation of beta-blocker therapy, the medication should generally be reinstituted, at least temporarily, along with other clinically appropriate measures.",
    "Due to their negative inotropic and chronotropic effects on the heart, beta-adrenergic receptor blocking agents (aka beta-blockers) reduce cardiac output and may precipitate or aggravate symptoms of arterial insufficiency in patients with peripheral vascular disease.  In addition, the nonselective beta-blockers (e.g., propranolol, pindolol, timolol) may attenuate catecholamine-mediated vasodilation during exercise by blocking beta-2 receptors in peripheral vessels.  Therapy with beta-blockers should be administered cautiously in patients with peripheral vascular disease.  Close monitoring for progression of arterial obstruction is advised.",
    "The active metabolite of acebutolol, diacetolol, is eliminated primarily by the kidney.  Patients with renal impairment may be at greater risk for adverse effects due to metabolite accumulation.  Dosage adjustments are recommended for patients with moderate to severe renal dysfunction (CrCl < 50 mL/min).",
    "The use of beta-adrenergic receptor blocking agents (aka beta-blockers) is contraindicated in patients with sinus bradyarrhythmia or heart block greater than the first degree (unless a functioning pacemaker is present).  Due to their negative inotropic and chronotropic effects on the heart, the use of beta-blockers is likely to exacerbate these conditions.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Beta-adrenergic blocking agents (beta-blockers), should be used with caution in patients with cerebrovascular insufficiency because of their potential effects relative to blood pressure and pulse.  If signs or symptoms suggesting reduced cerebral blood flow are observed, consideration should be given to discontinuing these agents.",
    "Patients with bronchospastic disease, should, in general, not receive beta blockers, including cardioselective beta-blockers.  Because of the relative beta-1 selectivity, cardioselective beta-blockers may be used in patients with bronchospastic disease who do not respond to, or cannot tolerate, other antihypertensive treatment.  Because beta-1 selectivity is not absolute, the lowest possible dose of these agents should be used.  Consider administering in smaller doses to avoid the higher plasma levels associated with the longer dosing intervals.  If dosage must be increased, dividing the dose should be considered to achieve lower peak blood levels.  It is recommended to have bronchodilators, including beta-2 agonists, readily available or administered concomitantly if necessary.",
    "Systemic beta-adrenergic receptor blocking agents (aka beta-blockers) may lower intraocular pressure.  Therefore, patients with glaucoma or intraocular hypertension may require adjustments in their ophthalmic regimen following a dosing change or discontinuation of beta-blocker therapy.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may alter serum lipid profiles.  Increases in serum VLDL and LDL cholesterol and triglycerides, as well as decreases in HDL cholesterol, have been reported with some beta-blockers.  Patients with preexisting hyperlipidemia may require closer monitoring during beta-blocker therapy, and adjustments made accordingly in their lipid-lowering regimen.",
    "When beta-adrenergic receptor blocking agents (aka beta-blockers) are used to alleviate symptoms of hyperthyroidism such as tachycardia, anxiety, tremor and heat intolerance, abrupt withdrawal can exacerbate thyrotoxicosis or precipitate a thyroid storm.  To minimize this risk, cessation of beta-blocker therapy, when necessary, should occur gradually with incrementally reduced dosages over a period of 1 to 2 weeks.  Patients should be advised not to discontinue treatment without first consulting with the physician.  Close monitoring is recommended during and after therapy withdrawal.",
    "Acebutolol should be used cautiously in patients with impaired hepatic function.",
    "Beta-adrenergic receptor blocking agents (aka beta-blockers) may potentiate muscle weakness consistent with certain myasthenic symptoms such as diplopia, ptosis, and generalized weakness.  Several beta-blockers have been associated rarely with aggravation of muscle weakness in patients with preexisting myasthenia gravis or myasthenic symptoms.  Use cautiously in patients with myasthenia gravis.",
    "Administration of beta-blockers alone in the setting of pheochromocytoma has been associated with a paradoxical increase in blood pressure due to the attenuation of beta receptor-mediated vasodilatation in skeletal muscle.  In patients with pheochromocytoma, an alpha-blocking agent should be initiated prior to the use of any beta-blocking agent.  Caution should be taken in the administration of these agents to patients suspected of having pheochromocytoma.",
    "The use of beta-blockers in psoriatic patients should be carefully weighed since the use of these agents may cause an aggravation in psoriasis.",
    "Beta-adrenergic blockade in patients with Wolff-Parkinson-White syndrome and tachycardia has been associated with severe bradycardia requiring treatment with a pacemaker.  In one case, this result was reported after an initial dose of 5 mg propranolol.  The use of beta-adrenergic receptor blocking agents (aka beta-blockers) should be administered cautiously in these patients.",
    "Therapeutic duplication warnings are only returned when drugs within the same group exceed the recommended therapeutic duplication maximum.",
    "Some mixtures of medications can lead to serious and even fatal consequences.",
    "Access drug & treatment information, identify pills, check interactions and set up personal medication records."
  ]
}